<a href="https://colab.research.google.com/github/Jorge-89/Data-Science-CoderHouse/blob/main/Titanic_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [44]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [42]:

#se importa el set de datos
url = 'https://raw.githubusercontent.com/Jorge-89/Data-Science-CoderHouse/main/titanic.csv'
df = pd.read_csv(url, sep =",")
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [43]:
df.head()

   PassengerId Survived     Pclass  ...     Fare Cabin  Embarked
1            0        3     Braund  ...     7.25   NaN         S
2            1        1    Cumings  ...  71.2833   C85         C
3            1        3  Heikkinen  ...    7.925   NaN         S
4            1        1   Futrelle  ...     53.1  C123         S
5            0        3      Allen  ...     8.05   NaN         S

[5 rows x 12 columns]